In [1]:
# importing pandas library as pd

import pandas as pd

# importing application_record dataset

In [2]:
# Reading application_record.csv file.
# This application_record.csv could be downloaded from the below provided link
# https://drive.google.com/file/d/1EJ454SyXT-RpEAfhqYu72bCyvZrY_ehg/view?usp=sharing
def read_app_data():
    application_data=pd.read_csv('application_record.csv')
    return application_data

## importing credit_card dataset

In [3]:
# This credit_record.csv could be downloaded from the below provided link
# https://drive.google.com/file/d/1LvjYFEztJJUYNhSa1eznfseCNHz3DgZb/view?usp=sharing
credit_record=pd.read_csv('credit_record.csv')

## Feature creation

In [4]:
application_data=read_app_data()
application_data.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

### Here columns like ID and DAYS_BIRTH are not relatable to datasets so we could these columns

In [5]:
def feature_creation():
    application_data.drop(['ID','DAYS_BIRTH'],axis=1)
    return application_data